{
  "version": "2.7.9",
  "releaseDate": "2024-12-27",
  "forceUpdate": false,
  "_comment": "Para actualizar la versión, solo modifica este archivo. La app lo leerá automáticamente.",
  "changes": {
    "all": [
      {
        "type": "improvement", 
        "description": "Integradas estadísticas completas en el panel de administración con filtros y exportación"
      },
      {
        "type": "fix", 
        "description": "Corregido problema de scroll en modales - agregada altura máxima y scroll funcional"
      },
      {
        "type": "fix", 
        "description": "Corregido error de props null en AdminModal - agregada validación defensiva y logs adicionales"
      },
      {
        "type": "change",
        "description": "Movidas las estadísticas del menú principal al panel de administración exclusivamente"
      },
      {
        "type": "new",
        "description": "Sistema de versiones dinámico - las actualizaciones ahora se leen automáticamente desde version.json"
      },
      {
        "type": "fix",
        "description": "Corregido error 400 de Firebase Firestore - configuración de cache simplificada."
      },
      {
        "type": "improvement",  
        "description": "Eliminadas advertencias de la consola: meta tag PWA actualizado."
      },
      {
        "type": "fix",
        "description": "Corregido error 'setShowRouteListModal is not defined' en el modal del mapa."
      },
      {
        "type": "removed",
        "description": "Eliminado modal de lista de ruta redundante - la funcionalidad ya existe en las tarjetas principales."
      },
      {
        "type": "improvement",
        "description": "Código optimizado y limpio tras eliminar funcionalidad duplicada."
      },
      {
        "type": "new",
        "description": "Aplicación reestructurada con componentes modulares para facilitar futuras actualizaciones."
      },
      {
        "type": "new",
        "description": "Sistema de autenticación mejorado con código de acceso en lugar de email."
      },
      {
        "type": "improvement",
        "description": "Modal de estadísticas completamente funcional con 3 vistas: General, Progreso y Rendimiento."
      },
      {
        "type": "improvement",
        "description": "Sistema de cambio de contraseña actualizado y funcional."
      }
    ],
    "admin": [
      {
        "type": "improvement",
        "description": "Estadísticas completas ahora integradas directamente en el panel de administración"
      },
      {
        "type": "new",
        "description": "Estadísticas exclusivas para administradores con exportación a PDF y Excel"
      },
      {
        "type": "new",
        "description": "Métricas completas: cobertura, territorios por período, publicadores inactivos y estimaciones"
      },
      {
        "type": "new",
        "description": "Filtros por fecha y gráficas de progreso mensual/anual"
      },
      {
        "type": "new",
        "description": "Panel de administración completo con gestión de propuestas, usuarios y territorios."
      },
      {
        "type": "new",
        "description": "Vista de estadísticas avanzadas para administradores."
      }
    ],
    "publisher": [
      {
        "type": "improvement",
        "description": "Menú móvil rediseñado con interfaz más limpia y elegante."
      },
      {
        "type": "improvement",
        "description": "Búsqueda mejorada con filtros por tipo (territorios/direcciones)."
      }
    ]
  },
  "lastUpdated": "2024-12-27"
}