{
  "version": "2.5.6",
  "date": "2025-01-29",
  "forceUpdate": false,
  "changes": {
    "all": [
      {
        "type": "fix",
        "description": "¡IMPORTANTE! Agregados permisos de ubicación al manifest.json - DEBES REINSTALAR LA APP."
      },
      {
        "type": "fix",
        "description": "Ahora la app solicita correctamente permisos de ubicación y aparecerá en configuración de Android/iOS."
      },
      {
        "type": "improvement",
        "description": "Agregadas meta tags de permisos para mejor compatibilidad con PWA."
      },
      {
        "type": "improvement",
        "description": "Service Worker actualizado para registrar permisos necesarios."
      },
      {
        "type": "improvement",
        "description": "¡Filtro 'En uso' mejorado! Ahora tus territorios asignados aparecen siempre al principio de la lista para un acceso más rápido."
      },
      {
        "type": "improvement",
        "description": "Nuevo indicador visual: un punto azul en el filtro 'En uso' te avisa si tienes territorios asignados sin necesidad de hacer clic."
      },
      {
        "type": "fix",
        "description": "Mejorado el contraste de los íconos en los botones de filtro activos para mayor claridad visual."
      },
       {
        "type": "fix",
        "description": "Se restauró el botón 'Agregar dirección' para los publicadores en la vista de territorio."
      },
      {
        "type": "fix",
        "description": "Corregido un error crítico que impedía cerrar la sesión correctamente."
      },
      {
        "type": "feature",
        "description": "Modal de ayuda para activar permisos de ubicación sin reinstalar"
      },
      {
        "type": "improvement",
        "description": "Flujo alternativo para usuarios con permisos bloqueados"
      },
      {
        "type": "improvement",
        "description": "Instrucciones paso a paso para activar ubicación manualmente"
      }
    ],
    "admin": [
      {
        "type": "fix",
        "description": "Solucionado un error que bloqueaba la aplicación al ver las propuestas de cambios pendientes."
      }
    ],
    "publisher": [
      {
        "type": "fix",
        "description": "Corregido un error que impedía visualizar el historial de propuestas en la sección 'Mis Propuestas'."
      },
      {
        "type": "feature",
        "description": "Botón para abrir configuración de la app directamente"
      }
    ]
  },
  "lastUpdated": "2024-01-01"
}