{
  "version": "2.11.2",
  "releaseDate": "2024-12-27",
  "forceUpdate": false,
  "_comment": "Para actualizar la versión, solo modifica este archivo. La app lo leerá automáticamente.",
  "changes": {
    "all": [
      {
        "type": "improvement", 
        "description": "FILTROS PERFECTOS: Distribución completa a lo ancho de pantalla, sin texto extra, solo íconos + contadores"
      },
      {
        "type": "improvement", 
        "description": "FILTROS COMPACTOS: Rediseño horizontal ultra-compacto, solo íconos en móvil para aprovechar espacio"
      },
      {
        "type": "major", 
        "description": "HISTORIAL COMPLETO DE PROPUESTAS: Sistema completo con filtros para ver todas las propuestas (pendientes, aprobadas, rechazadas)"
      },
      {
        "type": "improvement", 
        "description": "Filtros inteligentes: Pendientes, Todas, Aprobadas y Rechazadas con contadores y colores temáticos"
      },
      {
        "type": "improvement", 
        "description": "Información completa de propuestas procesadas: quién las procesó, cuándo y razón de rechazo"
      },
      {
        "type": "improvement", 
        "description": "Diseño optimizado para móvil: grid responsive 2x2 en móvil, 4x1 en desktop"
      },
      {
        "type": "fix", 
        "description": "Botón simplificado: 'Rechazar con Razón' cambiado a 'Rechazar'"
      },
      {
        "type": "major", 
        "description": "PROPUESTAS DETALLADAS: Vista completa con TODA la información de las propuestas de direcciones"
      },
      {
        "type": "improvement", 
        "description": "Propuestas de NUEVA dirección: Muestra dirección, género, referencia, notas y coordenadas completas"
      },
      {
        "type": "improvement", 
        "description": "Propuestas de EDICIÓN: Comparativa visual (antes vs después) de todos los campos modificados"
      },
      {
        "type": "improvement", 
        "description": "Información completa: fecha de propuesta, razón detallada y datos del territorio"
      },
      {
        "type": "cleanup", 
        "description": "LIMPIEZA COMPLETA: Eliminados TODOS los logs de debugging de LazyModals.jsx - consola 100% limpia"
      },
      {
        "type": "cleanup", 
        "description": "Eliminados logs de debugging temporales del hook useLazyComponent - código limpio y optimizado"
      },
      {
        "type": "redesign", 
        "description": "REDISEÑO TOTAL del Panel de Administrador - diseño espectacular, elegante y 100% optimizado para móviles"
      },
      {
        "type": "improvement", 
        "description": "Header elegante con gradiente #2C3E50, íconos FontAwesome y breadcrumb de navegación"
      },
      {
        "type": "improvement", 
        "description": "Vista de acciones principales completamente rediseñada con cards elegantes y colores temáticos"
      },
      {
        "type": "improvement", 
        "description": "Vista de propuestas con diseño moderno, gradientes y estados visuales claros"
      },
      {
        "type": "improvement", 
        "description": "Vista de usuarios separada por roles (Administradores/Publicadores) con diseño distintivo"
      },
      {
        "type": "improvement", 
        "description": "Vista de territorios con estadísticas rápidas, barras de progreso y información detallada"
      },
      {
        "type": "improvement", 
        "description": "Vista de acceso denegado rediseñada con diseño informativo y elegante"
      },
      {
        "type": "redesign", 
        "description": "REDISEÑO COMPLETO del modal de estadísticas para administradores - diseño espectacular y 100% optimizado para móviles"
      },
      {
        "type": "improvement", 
        "description": "Header elegante con gradientes, íconos FontAwesome y temática consistente con la aplicación"
      },
      {
        "type": "improvement", 
        "description": "StatCards completamente rediseñadas con gradientes, colores temáticos y animaciones hover"
      },
      {
        "type": "improvement", 
        "description": "Sección predictiva con diseño especial, decoraciones de fondo y texto degradado"
      },
      {
        "type": "improvement", 
        "description": "Tabs mejoradas, botones de exportación elegantes y navegación optimizada para móviles"
      },
      {
        "type": "fix", 
        "description": "Corregido error de ícono 'trophy' no encontrado - agregado al mapeo de íconos"
      },
      {
        "type": "fix", 
        "description": "Corregido problema de scroll en estadísticas para administradores - scroll completamente funcional"
      },
      {
        "type": "improvement", 
        "description": "Integradas estadísticas completas en el panel de administración con filtros y exportación"
      },
      {
        "type": "fix", 
        "description": "Corregido error de props null en AdminModal - agregada validación defensiva y logs adicionales"
      },
      {
        "type": "change",
        "description": "Movidas las estadísticas del menú principal al panel de administración exclusivamente"
      },
      {
        "type": "new",
        "description": "Sistema de versiones dinámico - las actualizaciones ahora se leen automáticamente desde version.json"
      },
      {
        "type": "fix",
        "description": "Corregido error 400 de Firebase Firestore - configuración de cache simplificada."
      },
      {
        "type": "improvement",  
        "description": "Eliminadas advertencias de la consola: meta tag PWA actualizado."
      },
      {
        "type": "fix",
        "description": "Corregido error 'setShowRouteListModal is not defined' en el modal del mapa."
      },
      {
        "type": "removed",
        "description": "Eliminado modal de lista de ruta redundante - la funcionalidad ya existe en las tarjetas principales."
      },
      {
        "type": "improvement",
        "description": "Código optimizado y limpio tras eliminar funcionalidad duplicada."
      },
      {
        "type": "new",
        "description": "Aplicación reestructurada con componentes modulares para facilitar futuras actualizaciones."
      },
      {
        "type": "new",
        "description": "Sistema de autenticación mejorado con código de acceso en lugar de email."
      },
      {
        "type": "improvement",
        "description": "Modal de estadísticas completamente funcional con 3 vistas: General, Progreso y Rendimiento."
      },
      {
        "type": "improvement",
        "description": "Sistema de cambio de contraseña actualizado y funcional."
      }
    ],
    "admin": [
      {
        "type": "improvement",
        "description": "FILTROS OPTIMIZADOS: Grid 4x1 que ocupa toda la pantalla, sin espacio desperdiciado, interfaz más limpia y eficiente"
      },
      {
        "type": "improvement",
        "description": "UX OPTIMIZADA: Filtros horizontales compactos que muestran solo íconos+contadores en móvil, maximizando espacio para propuestas"
      },
      {
        "type": "major",
        "description": "HISTORIAL COMPLETO DE PROPUESTAS - Sistema avanzado con filtros para gestionar todas las propuestas de forma eficiente"
      },
      {
        "type": "improvement",
        "description": "4 filtros inteligentes: Pendientes (para procesar), Todas (historial completo), Aprobadas y Rechazadas"
      },
      {
        "type": "improvement",
        "description": "Información de trazabilidad: quién procesó cada propuesta, cuándo y razón de rechazo detallada"
      },
      {
        "type": "improvement",
        "description": "UX mejorada: botones solo para pendientes, estados visuales claros, diseño 100% móvil-friendly"
      },
      {
        "type": "major",
        "description": "PROPUESTAS CON INFORMACIÓN COMPLETA - Ahora muestra TODOS los datos de las propuestas para tomar decisiones informadas"
      },
      {
        "type": "improvement",
        "description": "Vista detallada de nuevas direcciones: dirección completa, género, referencia, notas y coordenadas"
      },
      {
        "type": "improvement",
        "description": "Vista comparativa de ediciones: muestra datos actuales vs propuestos con códigos de color"
      },
      {
        "type": "improvement",
        "description": "Información contextual: fecha de propuesta, territorio y razón completa del publicador"
      },
      {
        "type": "redesign",
        "description": "PANEL DE ADMINISTRADOR COMPLETAMENTE REDISEÑADO - diseño profesional, elegante y 100% optimizado para móviles"
      },
      {
        "type": "improvement",
        "description": "Navegación intuitiva con breadcrumbs, cards temáticas con colores diferenciados y efectos hover espectaculares"
      },
      {
        "type": "improvement",
        "description": "Vista de propuestas con diseño moderno y botones de acción elegantes"
      },
      {
        "type": "improvement",
        "description": "Gestión de usuarios separada por roles con diseño distintivo para administradores y publicadores"
      },
      {
        "type": "improvement",
        "description": "Vista de territorios con estadísticas en tiempo real, barras de progreso y estado visual"
      },
      {
        "type": "redesign",
        "description": "Modal de estadísticas completamente rediseñado con diseño espectacular, gradientes elegantes y 100% optimizado para móviles"
      },
      {
        "type": "improvement",
        "description": "Estadísticas completas ahora integradas directamente en el panel de administración"
      },
      {
        "type": "new",
        "description": "Estadísticas exclusivas para administradores con exportación a PDF y Excel"
      },
      {
        "type": "new",
        "description": "Métricas completas: cobertura, territorios por período, publicadores inactivos y estimaciones"
      },
      {
        "type": "new",
        "description": "Filtros por fecha y gráficas de progreso mensual/anual"
      },
      {
        "type": "new",
        "description": "Panel de administración completo con gestión de propuestas, usuarios y territorios."
      },
      {
        "type": "new",
        "description": "Vista de estadísticas avanzadas para administradores."
      }
    ],
    "publisher": [
      {
        "type": "improvement",
        "description": "Menú móvil rediseñado con interfaz más limpia y elegante."
      },
      {
        "type": "improvement",
        "description": "Búsqueda mejorada con filtros por tipo (territorios/direcciones)."
      }
    ]
  },
  "lastUpdated": "2024-12-27"
}