{
  "version": "2.5.9",
  "date": "2025-01-29",
  "forceUpdate": false,
  "changes": {
    "all": [
      {
        "type": "fix",
        "description": "¡IMPORTANTE! Agregados permisos de ubicación al manifest.json - DEBES REINSTALAR LA APP."
      },
      {
        "type": "fix",
        "description": "Ahora la app solicita correctamente permisos de ubicación y aparecerá en configuración de Android/iOS."
      },
      {
        "type": "improvement",
        "description": "Agregadas meta tags de permisos para mejor compatibilidad con PWA."
      },
      {
        "type": "improvement",
        "description": "Service Worker actualizado para registrar permisos necesarios."
      },
      {
        "type": "improvement",
        "description": "¡Filtro 'En uso' mejorado! Ahora tus territorios asignados aparecen siempre al principio de la lista para un acceso más rápido."
      },
      {
        "type": "improvement",
        "description": "Nuevo indicador visual: un punto azul en el filtro 'En uso' te avisa si tienes territorios asignados sin necesidad de hacer clic."
      },
      {
        "type": "fix",
        "description": "Mejorado el contraste de los íconos en los botones de filtro activos para mayor claridad visual."
      },
       {
        "type": "fix",
        "description": "Se restauró el botón 'Agregar dirección' para los publicadores en la vista de territorio."
      },
      {
        "type": "fix",
        "description": "Corregido un error crítico que impedía cerrar la sesión correctamente."
      },
      {
        "type": "feature",
        "description": "Modal de ayuda para activar permisos de ubicación sin reinstalar"
      },
      {
        "type": "improvement",
        "description": "Flujo alternativo para usuarios con permisos bloqueados"
      },
      {
        "type": "improvement",
        "description": "Instrucciones paso a paso para activar ubicación manualmente"
      },
      {
        "type": "improvement",
        "description": "Flujo simplificado para permisos de ubicación con recarga automática"
      },
      {
        "type": "fix",
        "description": "Solucionado: El diálogo de permisos de ubicación ahora aparece correctamente"
      },
      {
        "type": "improvement",
        "description": "Eliminada verificación previa que bloqueaba los permisos"
      },
      {
        "type": "fix",
        "description": "Solucionado problema crítico: La app ya no se reinstala en cada carga"
      },
      {
        "type": "fix",
        "description": "Los permisos de ubicación ahora se mantienen correctamente"
      }
    ],
    "admin": [],
    "publisher": [
      {
        "type": "fix",
        "description": "Corregido un error que impedía visualizar el historial de propuestas en la sección 'Mis Propuestas'."
      },
      {
        "type": "feature",
        "description": "Botón para abrir configuración de la app directamente"
      },
      {
        "type": "improvement",
        "description": "Instrucciones más claras cuando los permisos están bloqueados"
      },
      {
        "type": "fix",
        "description": "Ruta optimizada funciona correctamente al primer intento"
      },
      {
        "type": "fix",
        "description": "Ruta optimizada ahora funciona correctamente sin pedir permisos repetidamente"
      }
    ]
  },
  "lastUpdated": "2024-01-01"
}