{
  "version": "2.12.1",
  "releaseDate": "2024-12-27",
  "forceUpdate": false,
  "_comment": "Para actualizar la versi칩n, solo modifica este archivo. La app lo leer치 autom치ticamente.",
  "changes": {
    "all": [
      {
        "type": "fix", 
        "description": "CORRECCI칍N CR칈TICA: Arreglado error de importaci칩n que imped칤a abrir la aplicaci칩n"
      },
      {
        "type": "major", 
        "description": "游꿀 MIS PROPUESTAS - Nueva secci칩n completa para que cada publicador vea SUS propuestas con filtros y notificaciones"
      },
      {
        "type": "feature", 
        "description": "TRANSPARENCIA TOTAL: Qui칠n proces칩 tu propuesta, cu치ndo y por qu칠 fue rechazada - informaci칩n completa agrupada"
      },
      {
        "type": "feature", 
        "description": "NOTIFICACIONES INTELIGENTES: Badge rojo en men칰 que muestra propuestas procesadas desde tu 칰ltima visita"
      },
      {
        "type": "improvement", 
        "description": "NAVEGACI칍N AVANZADA: Vista dedicada con historial del navegador, no solo un modal temporal"
      },
      {
        "type": "improvement", 
        "description": "FILTROS SIMPLIFICADOS: Solo 3 filtros esenciales (Pendientes, Aprobadas, Rechazadas) - Grid 3x1 perfecto"
      },
      {
        "type": "fix", 
        "description": "INTERFAZ LIMPIA: Eliminada barra grande molesta que aparec칤a al cambiar filtros, interfaz m치s elegante"
      },
      {
        "type": "improvement", 
        "description": "FILTROS PERFECTOS: Distribuci칩n completa a lo ancho de pantalla, sin texto extra, solo 칤conos + contadores"
      },
      {
        "type": "improvement", 
        "description": "FILTROS COMPACTOS: Redise침o horizontal ultra-compacto, solo 칤conos en m칩vil para aprovechar espacio"
      },
      {
        "type": "major", 
        "description": "HISTORIAL COMPLETO DE PROPUESTAS: Sistema completo con filtros para ver todas las propuestas (pendientes, aprobadas, rechazadas)"
      },
      {
        "type": "improvement", 
        "description": "Filtros inteligentes: Pendientes, Todas, Aprobadas y Rechazadas con contadores y colores tem치ticos"
      },
      {
        "type": "improvement", 
        "description": "Informaci칩n completa de propuestas procesadas: qui칠n las proces칩, cu치ndo y raz칩n de rechazo"
      },
      {
        "type": "improvement", 
        "description": "Dise침o optimizado para m칩vil: grid responsive 2x2 en m칩vil, 4x1 en desktop"
      },
      {
        "type": "fix", 
        "description": "Bot칩n simplificado: 'Rechazar con Raz칩n' cambiado a 'Rechazar'"
      },
      {
        "type": "major", 
        "description": "PROPUESTAS DETALLADAS: Vista completa con TODA la informaci칩n de las propuestas de direcciones"
      },
      {
        "type": "improvement", 
        "description": "Propuestas de NUEVA direcci칩n: Muestra direcci칩n, g칠nero, referencia, notas y coordenadas completas"
      },
      {
        "type": "improvement", 
        "description": "Propuestas de EDICI칍N: Comparativa visual (antes vs despu칠s) de todos los campos modificados"
      },
      {
        "type": "improvement", 
        "description": "Informaci칩n completa: fecha de propuesta, raz칩n detallada y datos del territorio"
      },
      {
        "type": "cleanup", 
        "description": "LIMPIEZA COMPLETA: Eliminados TODOS los logs de debugging de LazyModals.jsx - consola 100% limpia"
      },
      {
        "type": "cleanup", 
        "description": "Eliminados logs de debugging temporales del hook useLazyComponent - c칩digo limpio y optimizado"
      },
      {
        "type": "redesign", 
        "description": "REDISE칌O TOTAL del Panel de Administrador - dise침o espectacular, elegante y 100% optimizado para m칩viles"
      },
      {
        "type": "improvement", 
        "description": "Header elegante con gradiente #2C3E50, 칤conos FontAwesome y breadcrumb de navegaci칩n"
      },
      {
        "type": "improvement", 
        "description": "Vista de acciones principales completamente redise침ada con cards elegantes y colores tem치ticos"
      },
      {
        "type": "improvement", 
        "description": "Vista de propuestas con dise침o moderno, gradientes y estados visuales claros"
      },
      {
        "type": "improvement", 
        "description": "Vista de usuarios separada por roles (Administradores/Publicadores) con dise침o distintivo"
      },
      {
        "type": "improvement", 
        "description": "Vista de territorios con estad칤sticas r치pidas, barras de progreso y informaci칩n detallada"
      },
      {
        "type": "improvement", 
        "description": "Vista de acceso denegado redise침ada con dise침o informativo y elegante"
      },
      {
        "type": "redesign", 
        "description": "REDISE칌O COMPLETO del modal de estad칤sticas para administradores - dise침o espectacular y 100% optimizado para m칩viles"
      },
      {
        "type": "improvement", 
        "description": "Header elegante con gradientes, 칤conos FontAwesome y tem치tica consistente con la aplicaci칩n"
      },
      {
        "type": "improvement", 
        "description": "StatCards completamente redise침adas con gradientes, colores tem치ticos y animaciones hover"
      },
      {
        "type": "improvement", 
        "description": "Secci칩n predictiva con dise침o especial, decoraciones de fondo y texto degradado"
      },
      {
        "type": "improvement", 
        "description": "Tabs mejoradas, botones de exportaci칩n elegantes y navegaci칩n optimizada para m칩viles"
      },
      {
        "type": "fix", 
        "description": "Corregido error de 칤cono 'trophy' no encontrado - agregado al mapeo de 칤conos"
      },
      {
        "type": "fix", 
        "description": "Corregido problema de scroll en estad칤sticas para administradores - scroll completamente funcional"
      },
      {
        "type": "improvement", 
        "description": "Integradas estad칤sticas completas en el panel de administraci칩n con filtros y exportaci칩n"
      },
      {
        "type": "fix", 
        "description": "Corregido error de props null en AdminModal - agregada validaci칩n defensiva y logs adicionales"
      },
      {
        "type": "change",
        "description": "Movidas las estad칤sticas del men칰 principal al panel de administraci칩n exclusivamente"
      },
      {
        "type": "new",
        "description": "Sistema de versiones din치mico - las actualizaciones ahora se leen autom치ticamente desde version.json"
      },
      {
        "type": "fix",
        "description": "Corregido error 400 de Firebase Firestore - configuraci칩n de cache simplificada."
      },
      {
        "type": "improvement",  
        "description": "Eliminadas advertencias de la consola: meta tag PWA actualizado."
      },
      {
        "type": "fix",
        "description": "Corregido error 'setShowRouteListModal is not defined' en el modal del mapa."
      },
      {
        "type": "removed",
        "description": "Eliminado modal de lista de ruta redundante - la funcionalidad ya existe en las tarjetas principales."
      },
      {
        "type": "improvement",
        "description": "C칩digo optimizado y limpio tras eliminar funcionalidad duplicada."
      },
      {
        "type": "new",
        "description": "Aplicaci칩n reestructurada con componentes modulares para facilitar futuras actualizaciones."
      },
      {
        "type": "new",
        "description": "Sistema de autenticaci칩n mejorado con c칩digo de acceso en lugar de email."
      },
      {
        "type": "improvement",
        "description": "Modal de estad칤sticas completamente funcional con 3 vistas: General, Progreso y Rendimiento."
      },
      {
        "type": "improvement",
        "description": "Sistema de cambio de contrase침a actualizado y funcional."
      }
          ],
      "publisher": [
        {
          "type": "fix",
          "description": "游댢 APLICACI칍N FUNCIONANDO: Corregido error que imped칤a abrir la app (hook useApp vs useAppContext)"
        },
        {
          "type": "major",
          "description": "游꿀 NUEVA SECCI칍N: 'Mis Propuestas' - Tu espacio personal para ver todas tus solicitudes de direcciones"
        },
        {
          "type": "feature",
          "description": "INFORMACI칍N COMPLETA: Ve qui칠n proces칩 tus propuestas, cu치ndo y por qu칠 fueron rechazadas"
        },
        {
          "type": "feature",
          "description": "NOTIFICACIONES AUTOM츼TICAS: Badge rojo te avisa cuando hay cambios nuevos en tus propuestas"
        },
        {
          "type": "feature",
          "description": "FILTROS PERSONALES: Pendientes (en espera), Aprobadas (aceptadas), Rechazadas con razones detalladas"
        },
        {
          "type": "feature",
          "description": "MODAL DETALLADO: Toca 'Ver Detalles Completos' para informaci칩n exhaustiva de cada propuesta"
        }
      ],
      "admin": [
        {
          "type": "improvement",
          "description": "EXPERIENCIA MEJORADA: Solo los 3 filtros que realmente importan - sin opciones innecesarias, navegaci칩n m치s directa"
        },
      {
        "type": "improvement",
        "description": "FILTROS OPTIMIZADOS: Grid 3x1 que ocupa toda la pantalla, sin espacio desperdiciado, interfaz m치s limpia y eficiente"
      },
      {
        "type": "improvement",
        "description": "UX OPTIMIZADA: Filtros horizontales compactos que muestran solo 칤conos+contadores en m칩vil, maximizando espacio para propuestas"
      },
      {
        "type": "major",
        "description": "HISTORIAL COMPLETO DE PROPUESTAS - Sistema avanzado con filtros para gestionar todas las propuestas de forma eficiente"
      },
      {
        "type": "improvement",
        "description": "4 filtros inteligentes: Pendientes (para procesar), Todas (historial completo), Aprobadas y Rechazadas"
      },
      {
        "type": "improvement",
        "description": "Informaci칩n de trazabilidad: qui칠n proces칩 cada propuesta, cu치ndo y raz칩n de rechazo detallada"
      },
      {
        "type": "improvement",
        "description": "UX mejorada: botones solo para pendientes, estados visuales claros, dise침o 100% m칩vil-friendly"
      },
      {
        "type": "major",
        "description": "PROPUESTAS CON INFORMACI칍N COMPLETA - Ahora muestra TODOS los datos de las propuestas para tomar decisiones informadas"
      },
      {
        "type": "improvement",
        "description": "Vista detallada de nuevas direcciones: direcci칩n completa, g칠nero, referencia, notas y coordenadas"
      },
      {
        "type": "improvement",
        "description": "Vista comparativa de ediciones: muestra datos actuales vs propuestos con c칩digos de color"
      },
      {
        "type": "improvement",
        "description": "Informaci칩n contextual: fecha de propuesta, territorio y raz칩n completa del publicador"
      },
      {
        "type": "redesign",
        "description": "PANEL DE ADMINISTRADOR COMPLETAMENTE REDISE칌ADO - dise침o profesional, elegante y 100% optimizado para m칩viles"
      },
      {
        "type": "improvement",
        "description": "Navegaci칩n intuitiva con breadcrumbs, cards tem치ticas con colores diferenciados y efectos hover espectaculares"
      },
      {
        "type": "improvement",
        "description": "Vista de propuestas con dise침o moderno y botones de acci칩n elegantes"
      },
      {
        "type": "improvement",
        "description": "Gesti칩n de usuarios separada por roles con dise침o distintivo para administradores y publicadores"
      },
      {
        "type": "improvement",
        "description": "Vista de territorios con estad칤sticas en tiempo real, barras de progreso y estado visual"
      },
      {
        "type": "redesign",
        "description": "Modal de estad칤sticas completamente redise침ado con dise침o espectacular, gradientes elegantes y 100% optimizado para m칩viles"
      },
      {
        "type": "improvement",
        "description": "Estad칤sticas completas ahora integradas directamente en el panel de administraci칩n"
      },
      {
        "type": "new",
        "description": "Estad칤sticas exclusivas para administradores con exportaci칩n a PDF y Excel"
      },
      {
        "type": "new",
        "description": "M칠tricas completas: cobertura, territorios por per칤odo, publicadores inactivos y estimaciones"
      },
      {
        "type": "new",
        "description": "Filtros por fecha y gr치ficas de progreso mensual/anual"
      },
      {
        "type": "new",
        "description": "Panel de administraci칩n completo con gesti칩n de propuestas, usuarios y territorios."
      },
      {
        "type": "new",
        "description": "Vista de estad칤sticas avanzadas para administradores."
      }
    ],
    "publisher": [
      {
        "type": "improvement",
        "description": "Men칰 m칩vil redise침ado con interfaz m치s limpia y elegante."
      },
      {
        "type": "improvement",
        "description": "B칰squeda mejorada con filtros por tipo (territorios/direcciones)."
      }
    ]
  },
  "lastUpdated": "2024-12-27"
}